---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetAttachmentType
source: html/4cde7b4f-6636-9ee8-f421-47f8e4887fee.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetAttachmentType Method

Returns attachment type for stirrups to be used in cover calculation.

## Syntax (C#)
```csharp
public StirrupTieAttachmentType GetAttachmentType()
```

## Returns
InteriorFace : rebar to attach to interior face of cover reference. ExteriorFace : rebar to attach to exterior face of cover reference.